# RebarElemHookEndOrient Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarElemHookEndOrient Property
ParameterTypeId Class See Also
---
"Hook Orientation At End"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarElemHookEndOrient { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarElemHookEndOrient As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarElemHookEndOrient {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace